<a href="https://colab.research.google.com/github/Miumumo/itri_ml_course/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [4]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

In [16]:
df.loc[500:600]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
500          501         0       3  ...   8.6625   NaN         S
501          502         0       3  ...   7.7500   NaN         Q
502          503         0       3  ...   7.6292   NaN         Q
503          504         0       3  ...   9.5875   NaN         S
504          505         1       1  ...  86.5000   B79         S
..           ...       ...     ...  ...      ...   ...       ...
596          597         1       2  ...  33.0000   NaN         S
597          598         0       3  ...   0.0000   NaN         S
598          599         0       3  ...   7.2250   NaN         C
599          600         1       1  ...  56.9292   A20         C
600          601         1       2  ...  27.0000   NaN         S

[101 rows x 12 columns]

In [54]:
sdf = df.loc[:, ['Survived', 'Sex', 'Age', 'Embarked']]

In [72]:
print(sdf.isna().any())

Survived    False
Sex         False
Age         False
Embarked    False
dtype: bool

In [57]:
a = sdf.loc[:, 'Age'].median()
sdf.loc[:, 'Age'].fillna(a, inplace=True)
a

28.0

In [73]:
b = sdf.loc[:, 'Embarked'].mode()
print(b)
sdf.loc[:, 'Embarked'].fillna(b.values[0], inplace=True)

0    S
dtype: object

In [77]:
b.values[0]
b[0]

'S'

In [ ]:
''